<?php

return [
    'type'       => [
        'label'        => 'Дополнение',
        'instructions' => 'Выберите дополнение, которое хотите добавить',
        'placeholder'  => 'Все дополнения',
    ],
    'mode'       => [
        'label'        => 'Внешний вид',
        'instructions' => 'Стиль отображения поля ввода',
        'option'       => [
            'search'   => 'Поисковая строка',
            'dropdown' => 'Выпадающее меню',
        ],
    ],
    'search'     => [
        'label'        => 'Поисковые расширения',
        'instructions' => 'Если выбрано дополнение "Расширения", то здесь Вы можете задать поисковые параметры, чтобы поиск по расширениям возвращал более конкретные результаты.',
        'placeholder'  => 'anomaly.module.files::adapter.*',
    ],
    'theme_type' => [
        'label'        => 'Темы',
        'instructions' => 'Если выбрано дополнение "Темы", то Вы можете ограничить выбор тем только административными или общедоступными.',
        'placeholder'  => 'Административные и общедоступные',
        'admin'        => 'Административные',
        'public'       => 'Общедоступные',
    ],
];
